export default function OurVision() {
    return (
        <div
            className="container px-6 py-8 mx-auto mt-10 rtl:font-Almarai"
            dir="rtl"
        >
            <header className="mb-10 text-center">
                <h1 className="text-3xl font-semibold text-gray-800">رؤيتنا</h1>
                <p className="mt-2 text-lg text-gray-600">
                    مرحبًا بك في صفحة رؤيتنا. هنا في ارابيا، نطمح لأن نكون أكثر
                    من مجرد منصة تسوق، بل نسعى إلى خلق تجربة فريدة ومتطورة لخدمة
                    عملائنا وتجارتهم.
                </p>
            </header>

            <main className="container p-6 mx-auto mt-6 bg-white rounded-lg shadow-lg">
                <section>
                    <h2 className="mb-4 text-xl font-semibold">
                        نُبذة عن ارابيا
                    </h2>
                    <p className="mb-6 text-base leading-7">
                        يُعد هذا الموقع منصة للتجارة الإلكترونية التي تتيح
                        للمؤسسات التجارية والشركات والأفراد عرض وبيع المنتجات.
                        نهدف إلى تقديم تجربة تسوق استثنائية تجمع بين الثقة،
                        الأمان، والتنويع. تسعى "ارابيا" لأن تكون الوجهة الأولى
                        للعملاء الباحثين عن جميع المنتجات التي تلبي احتياجاتهم
                        اليومية بأسعار تنافسية من خلال عروضنا اليومية. نؤمن بأن
                        تقديم قيمة حقيقية لعملائنا يبدأ من فهم احتياجاتهم وتوفير
                        حلول مبتكرة تسهل حياتهم.
                    </p>
                    <p className="mb-6 text-base leading-7">
                        نسعى لراحتك وأن نكون جزءك المفضل والأول في التسوق، من
                        خلال جعل كل عملية شراء موثوقة وممتعة لا تُنسى. علاوة على
                        ذلك، نطمح لبناء علاقة طويلة الأمد مع عملائنا أساسها
                        الثقة والشفافية، حيث نقدم لهم مفاجآت مستمرة تنال
                        سعادتهم، ونبذل قصارى جهدنا لإرضائهم. نحن نعتز بك عندما
                        تترك بصمتك معنا.
                    </p>
                </section>

                <section className="mt-8">
                    <h2 className="mb-4 text-xl font-semibold">رؤية ارابيا</h2>
                    <p className="mb-6 text-base leading-7">
                        <strong>
                            قيادة مستقبل التجارة الإلكترونية في العالم العربي
                        </strong>
                        <br />
                        تطمح ارابيا إلى أن تكون أكثر من مجرد منصة تسوق إلكتروني؛
                        فهي رؤية متكاملة تهدف إلى إعادة تعريف تجربة التجارة
                        الإلكترونية وجعلها تجربة فريدة ومتطورة تخدم العملاء
                        والتجار على حد سواء. تقوم رؤيتنا على الابتكار، التوسع،
                        وتعزيز الاقتصاد الرقمي في العالم العربي، مع التركيز على
                        تقديم خدمات تضاهي أفضل المعايير العالمية.
                    </p>
                </section>

                <section className="mt-8">
                    <h2 className="mb-4 text-xl font-semibold">
                        محاور رؤية ارابيا
                    </h2>
                    <ul className="space-y-4 list-decimal list-inside">
                        <li>
                            <p className="text-base leading-7">
                                أن تكون الوجهة الأولى للتسوق الإلكتروني في
                                العالم العربي:
                            </p>
                            <p className="text-base leading-7">
                                تهدف أرابيا إلى أن تصبح المنصة التي يتوجه إليها
                                كل فرد وعائلة لتلبية احتياجاتهم اليومية. نطمح
                                لأن نكون الاسم الأول الذي يتبادر إلى الذهن عند
                                التفكير في التسوق الإلكتروني.
                            </p>
                        </li>
                        <li>
                            <p className="text-base leading-7">
                                دعم التحول الرقمي في المنطقة:
                            </p>
                            <p className="text-base leading-7">
                                نؤمن بأهمية دور التجارة الإلكترونية في تعزيز
                                الاقتصاد الرقمي. رؤيتنا تشمل دعم الشركات الناشئة
                                وتوفير البنية التحتية اللازمة لتمكين الموردين
                                والتجار من الانخراط في العالم الرقمي بسهولة.
                            </p>
                        </li>
                        <li>
                            <p className="text-base leading-7">
                                الابتكار المستدام:
                            </p>
                            <ul className="ml-5 list-disc list-inside">
                                <li>
                                    الاستثمار في أحدث التقنيات مثل الذكاء
                                    الاصطناعي وتحليل البيانات لتوفير تجربة تسوق
                                    شخصية لكل عميل.
                                </li>
                                <li>
                                    تطوير حلول ذكية تجعل التسوق أكثر سهولة
                                    وراحة، مثل التسوق عبر الصوت أو الواقع
                                    المعزز.
                                </li>
                                <li>
                                    تحسين عمليات الشحن والتوصيل لتكون أسرع وأكثر
                                    كفاءة باستخدام التقنيات الحديثة.
                                </li>
                            </ul>
                        </li>
                        <li>
                            <p className="text-base leading-7">
                                تعزيز الهوية العربية بروح عالمية:
                            </p>
                            <p className="text-base leading-7">
                                تسعى أرابيا لتكون سفيرًا للعالم العربي في مجال
                                التجارة الإلكترونية، مع تقديم خدمات ومنتجات تعكس
                                الثقافة العربية الأصيلة، لكنها تتماشى مع
                                المعايير العالمية من حيث الجودة والاحترافية.
                            </p>
                        </li>
                        <li>
                            <p className="text-base leading-7">
                                التوسع الإقليمي والدولي:
                            </p>
                            <p className="text-base leading-7">
                                رؤيتنا تشمل النمو داخل العالم العربي، مع التوسع
                                إلى الأسواق الدولية لنقل العلامة التجارية
                                "أرابيا" كواجهة عالمية للتجارة الإلكترونية من
                                قلب العالم العربي.
                            </p>
                        </li>
                        <li>
                            <p className="text-base leading-7">
                                الاستدامة والمسؤولية الاجتماعية:
                            </p>
                            <ul className="ml-5 list-disc list-inside">
                                <li>
                                    تعزيز التجارة المستدامة من خلال دعم المنتجات
                                    الصديقة للبيئة.
                                </li>
                                <li>
                                    تقديم فرص للتجار الصغار والشركات الناشئة
                                    للنمو والتوسع.
                                </li>
                                <li>
                                    المساهمة في تنمية المجتمعات المحلية من خلال
                                    الشراكات والمبادرات الاجتماعية.
                                </li>
                            </ul>
                        </li>
                        <li>
                            <p className="text-base leading-7">
                                تجربة تسوق شاملة ومتطورة:
                            </p>
                            <ul className="ml-5 list-disc list-inside">
                                <li>
                                    العمل على تطوير منصة ذكية تتعلم من احتياجات
                                    العملاء وتقدم لهم ما يناسبهم.
                                </li>
                                <li>
                                    توفير حلول دفع متقدمة وآمنة تدعم التقنيات
                                    المالية الحديثة (Fintech).
                                </li>
                                <li>
                                    ضمان استمرارية التفاعل مع العملاء لتحسين
                                    تجربتهم بشكل مستمر.
                                </li>
                            </ul>
                        </li>
                    </ul>
                </section>
            </main>
        </div>
    );
}
