export default function Terms() {
    return (
        <div
            className="container px-6 py-8 mx-auto mt-10 rtl:font-Almarai"
            dir="rtl"
        >
            <header className="mb-10 text-center">
                <h1 className="text-3xl font-semibold text-gray-800">
                    شروط الاستخدام
                </h1>
                <p className="mt-2 text-lg text-gray-600">
                    مرحبًا بك في شروط الاستخدام، ونعلمك بأنه باستخدامك لمنصتنا،
                    فإنك توافق على الالتزام بجميع الشروط والأحكام.
                </p>
            </header>

            <div className="p-6 bg-white rounded-lg shadow-md">
                <section className="mb-6">
                    <p className="text-lg leading-relaxed">
                        مرحبًا بك في شروط الاستخدام، ونعلمك بأنه باستخدامك
                        لمنصتنا، فإنك توافق على الالتزام بجميع الشروط والأحكام
                        الواردة في هذه الوثيقة. من فضلك اقرأ هذه الشروط بعناية
                        قبل البدء في استخدام خدماتنا.
                    </p>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        1. قبول شروط الاستخدام
                    </h2>
                    <p>
                        عند دخولك إلى منصة أرابيا أو استخدام أي من خدماتنا، فإنك
                        توافق بشكل كامل على الالتزام بهذه الشروط والأحكام، بما
                        في ذلك أي تحديثات قد تطرأ عليها في المستقبل. إذا كنت لا
                        توافق على أي من هذه الشروط، يجب عليك عدم استخدام منصتنا.
                    </p>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        2. إنشاء حساب المستخدم
                    </h2>
                    <div className="mt-4">
                        <h3 className="text-lg font-semibold text-gray-700">
                            • التسجيل:
                        </h3>
                        <p>
                            للوصول إلى خدماتنا، يتعين عليك إنشاء حساب مستخدم على
                            منصتنا. خلال عملية التسجيل، يُطلب منك تقديم معلومات
                            شخصية دقيقة، بما في ذلك البريد الإلكتروني وكلمة
                            المرور.
                        </p>
                    </div>
                    <div className="mt-4">
                        <h3 className="text-lg font-semibold text-gray-700">
                            • مسؤولية الحساب:
                        </h3>
                        <p>
                            أنت مسؤول عن الحفاظ على سرية معلومات حسابك، بما في
                            ذلك كلمة المرور، وأنت تتحمل المسؤولية الكاملة عن
                            جميع الأنشطة التي تحدث تحت حسابك.
                        </p>
                    </div>
                    <div className="mt-4">
                        <h3 className="text-lg font-semibold text-gray-700">
                            • الأهلية:
                        </h3>
                        <p>
                            يجب أن تكون في سن قانوني يسمح لك باستخدام المنصة
                            وفقًا للتشريعات المعمول بها في بلدك.
                        </p>
                    </div>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        3. استخدام المحتوى
                    </h2>
                    <ul className="pl-6 space-y-2 list-disc">
                        <li>
                            الشفافية والوضوح: يجب أن تقدم معلومات دقيقة وصحيحة
                            عن المنتجات التي تعرضها، ولا يجوز لك تقديم معلومات
                            مضللة أو غير صحيحة.
                        </li>
                        <li>
                            اللغة المناسبة: عليك استخدام لغة لائقة تتناسب مع
                            جمهورك وهويتك التجارية.
                        </li>
                        <li>
                            توافق المحتوى مع الهوية التجارية: يجب أن يكون
                            المحتوى الذي تقدمه متوافقًا مع هوية المتجر ويمثل
                            العلامة التجارية بما يتناسب مع قيمنا.
                        </li>
                        <li>
                            الامتثال للقوانين: يجب أن يتوافق المحتوى المقدم مع
                            القوانين المحلية والدولية المتعلقة بالإعلانات، حقوق
                            النشر، والعلامات التجارية.
                        </li>
                    </ul>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        4. حقوق الملكية الفكرية
                    </h2>
                    <div className="mt-4">
                        <h3 className="text-lg font-semibold text-gray-700">
                            • الملكية:
                        </h3>
                        <p>
                            جميع المحتويات الموجودة على الموقع بما في ذلك النصوص
                            والصور والشعارات والبيانات المحفوظة هي ملك أرابيا
                            ومحمية بموجب قوانين حقوق الملكية الفكرية المحلية
                            والدولية.
                        </p>
                    </div>
                    <div className="mt-4">
                        <h3 className="text-lg font-semibold text-gray-700">
                            • استخدام المحتوى:
                        </h3>
                        <p>
                            لا يحق لك نسخ، تعديل، نشر، أو استخدام أي جزء من
                            المحتوى لأغراض تجارية دون إذن مسبق من مالك المتجر.
                            يمكنك استخدام المحتوى لأغراض شخصية فقط مع الإشارة
                            إلى أرابيا كمصدر موثوق.
                        </p>
                    </div>
                    <div className="mt-4">
                        <h3 className="text-lg font-semibold text-gray-700">
                            • التعديلات على المحتوى:
                        </h3>
                        <p>
                            في حال رغبت في تعديل المحتوى أو استخدامه خارج نطاق
                            الاستخدام الشخصي، يجب الحصول على إذن كتابي من
                            أرابيا.
                        </p>
                    </div>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        5. التعامل مع العملاء والتفاعل
                    </h2>
                    <ul className="pl-6 space-y-2 list-disc">
                        <li>
                            الرد على الاستفسارات: يجب على جميع التجار التفاعل مع
                            استفسارات العملاء وتعليقاتهم عبر المنصة لتعزيز
                            مصداقية المنتجات والمتجر.
                        </li>
                        <li>
                            المصداقية: من الضروري الرد على استفسارات العملاء في
                            وقت مناسب وبطريقة تعزز مصداقية المتجر.
                        </li>
                    </ul>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        6. شروط الدفع
                    </h2>
                    <ul className="pl-6 space-y-2 list-disc">
                        <li>
                            خيارات الدفع بين يديك: نحن نوفر لك مجموعة من خيارات
                            الدفع لتسهيل عملية الشراء، مثل الدفع الإلكتروني
                            والمحافظ الإلكترونية وبطاقات الائتمان والتحويل
                            البنكي.
                        </li>
                        <li>
                            المدفوعات: تكون المدفوعات على الموقع آمنة ومشفرة
                            لضمان حماية بياناتك المالية.
                        </li>
                    </ul>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        7. سياسات الاسترجاع والاستبدال
                    </h2>
                    <p>
                        يحق للعملاء استبدال أو استرجاع المنتجات وفقًا لسياسة
                        الاسترجاع المعتمدة. تُسترجع المبالغ المدفوعة من خلال نفس
                        وسيلة الدفع التي تم استخدامها عند الشراء، ويتم إشعار
                        العملاء بعملية الاسترجاع أو الاستبدال عبر البريد
                        الإلكتروني.
                    </p>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        8. التحديثات على شروط الاستخدام
                    </h2>
                    <p>
                        قد نقوم بتحديث هذه الشروط من وقت لآخر بناءً على تغييرات
                        في قوانين التجارة أو احتياجاتنا التشغيلية. سيتم إخطارك
                        بأي تعديلات من خلال إشعار عبر بريدك الإلكتروني أو إشعار
                        داخل حسابك الشخصي في المتجر. عليك مراجعة هذه الشروط بشكل
                        دوري لضمان التزامك بأحدث الإرشادات والشروط.
                    </p>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        9. تعليق أو إنهاء الحساب
                    </h2>
                    <div className="mt-4">
                        <h3 className="text-lg font-semibold text-gray-700">
                            • تعليق الحساب:
                        </h3>
                        <p>
                            يحق لنا تعليق أو إلغاء حساب المستخدم في حال ارتكاب
                            أي مخالفات لهذه الشروط أو في حالة استخدام المنصة
                            بطريقة غير قانونية أو مخالفة لأخلاقيات الاستخدام.
                        </p>
                    </div>
                    <div className="mt-4">
                        <h3 className="text-lg font-semibold text-gray-700">
                            • إلغاء الحساب:
                        </h3>
                        <p>
                            يمكنك إلغاء حسابك في أي وقت من خلال التواصل مع خدمة
                            العملاء. في حال تم إلغاء الحساب، سيظل المستخدم
                            ملزمًا بأي التزامات مالية قائمة.
                        </p>
                    </div>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        10. تحديد المسؤولية
                    </h2>
                    <ul className="pl-6 space-y-2 list-disc">
                        <li>
                            المسؤولية المحدودة: نحن في أرابيا نبذل قصارى جهدنا
                            لتقديم أفضل تجربة للمستخدمين، ولكننا لا نتحمل أي
                            مسؤولية عن الأضرار غير المباشرة أو الخسائر الناتجة
                            عن استخدام المنصة أو الاعتماد على المعلومات المقدمة
                            عليها.
                        </li>
                        <li>
                            الضمانات: لا نقدم أي ضمانات ضمنية أو صريحة حول دقة
                            أو اكتمال المعلومات المعروضة على الموقع.
                        </li>
                    </ul>
                </section>

                <section className="mb-6">
                    <h2 className="text-xl font-semibold text-gray-800">
                        11. القوانين المعمول بها
                    </h2>
                    <p>
                        تخضع هذه الشروط وأي نزاع ينشأ عنها للقوانين المحلية
                        السارية في البلد الذي تم تأسيس فيه أرابيا.
                    </p>
                </section>

                <section>
                    <p>
                        أرابيا هي شريكك الموثوق في تقديم تجربة تسوق مبتكرة
                        وموثوقة. نؤكد على أهمية احترام هذه الشروط لضمان تجربة
                        آمنة ومرضية لجميع مستخدمينا.
                    </p>
                </section>
            </div>
        </div>
    );
}
