export default function Vendor() {
    return (
        <div
            className="container px-2 py-8 mx-auto mt-10 rtl:font-Almarai"
            dir="rtl"
        >
            <section>
                <section className="mt-3 ">
                    <div className="">
                    <div className="mt-5 font-extrabold text-gray-700">
                        <h2 className="text-center text-gray-900 font-extrabold text-2xl">التاجر في ارابيا</h2> 
                        <p className="text-center mt-3">   
                          نحن في "ارابيا" ندرك أهمية دعم التجار في تحقيق النجاح. نقدم لك منصة متكاملة تتيح لك عرض منتجاتك لجمهور واسع بطريقة احترافية ومبتكرة.
                        </p>
                        
                        <br />
                        <br />
                        <h2 className=" text-gray-900 font-extrabold text-2xl">
                           ما الذي تقدمه ارابيا للتجار / الشركات؟
                        </h2>
                        <br />
                        تسعى ارابيا إلى دعم التجار بجميع الوسائل الممكنة لمساعدتهم على تحقيق النجاح والتوسع في سوق التجارة الإلكترونية. نقدم خدمات متكاملة تغطي كل جوانب العمل التجاري، من الترويج للمنتجات إلى تقديم الحلول اللوجستية المتطورة.
                        <br />
                        <br />
                       <span className="text-gray-900 font-extrabold text-xl my-2"> - الوصول إلى جمهور واسع</span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li>تتيح ارابيا للتجار عرض منتجاتهم أمام آلاف العملاء يوميًا في مختلف الدول العربية وخارجها.</li>
                            <li>نساعدك في بناء حضور قوي في السوق الإلكترونية، مما يتيح لك التوسع والوصول إلى عملاء جدد باستمرار.</li>
                        </ul>

                        <br />

                        <span className="text-gray-900 font-extrabold text-xl my-2">- تعزيز علامتك التجارية</span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> حملات تسويقية موجهة تهدف إلى رفع وعي العملاء بعلامتك التجارية وزيادة انتشارها.</li>
                            <li> تخصيص مساحات مميزة لعرض منتجاتك على المنصة، مثل الترويج على الصفحة الرئيسية وصفحات الفئات.</li>
                            <li> شراكات مع مؤثرين ومنصات إعلامية لزيادة شهرة منتجاتك.</li>
                        </ul>

                        <br />

                        <span className="text-gray-900 font-extrabold text-xl my-2">- إدارة احترافية وسهلة للمنتجات</span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> لوحة تحكم ذكية تساعدك على إضافة المنتجات وتعديلها بسهولة.</li>
                            <li> تتبع المخزون وتجنب نقص المنتجات.</li>
                            <li> إدارة الطلبات ومعرفة حالة كل طلب في الوقت الفعلي.</li>
                            <li> تقارير يومية وأسبوعية تقدم لك نظرة شاملة عن المبيعات والأداء.</li>
                        </ul>

                        <br />

                        <span className="text-gray-900 font-extrabold text-xl my-2">- حلول لوجستية متطورة</span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> تخزين المنتجات في مستودعات مجهزة بالكامل لضمان سلامة وجودة المنتجات.</li>
                            <li> شحن سريع وفعال مع خيارات متعددة تناسب جميع العملاء.</li>
                            <li> تتبع الطلبات خطوة بخطوة لتوفير تجربة موثوقة للعملاء.</li>
                        </ul>

                        <br />

                        <span className="text-gray-900 font-extrabold text-xl my-2">- نظام دفع آمن وشفاف</span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> ضمان تسليم أرباحك بشكل منتظم دون تأخير.</li>
                            <li> تقارير مالية مفصلة تشمل أرباحك وتكاليفك مع الشفافية الكاملة.</li>
                            <li> حلول دفع متكاملة تناسب العملاء في الأسواق المحلية والدولية.</li>
                        </ul>

                        <br />
                        <span className="text-gray-900 font-extrabold text-xl my-2">
                            - تحسين الأداء وزيادة المبيعات
                        </span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> أدوات تحليل بيانات متقدمة تتيح لك فهم سلوك العملاء وتفضيلاتهم.</li>
                            <li> تقارير أداء مفصلة تساعدك على تحسين استراتيجيتك التسويقية وزيادة المبيعات.</li>
                            <li> نصائح واستشارات من خبراء التجارة الإلكترونية في أرابيا لتحسين منتجاتك وعروضك.</li>
                        </ul>

                        <br />
                        <span className="text-gray-900 font-extrabold text-xl my-2">
                        - دعم مستمر وشامل
                        </span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> فريق دعم متخصص متاح للإجابة عن جميع أسئلتك ومساعدتك في أي مشكلة قد تواجهها.</li>
                            <li> برامج تدريبية لتعريفك بأحدث الاتجاهات في التجارة الإلكترونية وأفضل الممارسات.</li>
                            <li> موارد تعليمية تقدم نصائح حول تحسين عمليات البيع، إدارة المنتجات، والتسويق الفعال.</li>
                        </ul>

                        <br />
                        <span className="text-gray-900 font-extrabold text-xl my-2">
                        - تسويق مباشر للعملاء المستهدفين
                        </span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> حملات بريد إلكتروني وإشعارات فورية موجهة لجذب انتباه العملاء المناسبين لمنتجاتك.</li>
                            <li> برامج ولاء تشجع العملاء على تكرار الشراء من متجرك.</li>
                            <li> إنشاء عروض وخصومات حصرية تجذب العملاء وتزيد من مبيعاتك.</li>
                        </ul>

                        <br />
                        <span className="text-gray-900 font-extrabold text-xl my-2">
                        - حلول مبتكرة لتوسيع أعمالك
                        </span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> فرصة المشاركة في عروض موسمية مثل "الجمعة البيضاء" أو العروض الحصرية التي تنظمها أرابيا.</li>
                            <li> إعلانات مستهدفة داخل المنصة وخارجها لجذب المزيد من العملاء.</li>
                            <li> دعم التوسع إلى أسواق جديدة بفضل شراكات أرابيا مع شركات الشحن والدفع العالمية.</li>
                        </ul>

                        <br />
                        <span className="text-gray-900 font-extrabold text-xl my-2">
                        - بناء مجتمع من التجار الناجحين    
                        </span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> الانضمام إلى شبكة واسعة من التجار على أرابيا لمشاركة الخبرات والنصائح.</li>
                            <li> إنشاء بيئة عمل تدعم التعاون والتعلم المشترك.</li>
                            <li> توفير أدوات لتحسين العمل الجماعي داخل فريقك التجاري.</li>
                        </ul>

                        <br />
                        <span className="text-gray-900 font-extrabold text-xl my-2">
                        - تعزيز الاستدامة والمسؤولية الاجتماعية
                        </span>
                        <ul className="pl-6 text-gray-700 list-disc">
                            <li> دعم التجار في تقديم منتجات صديقة للبيئة ومواكبة للاتجاهات الحديثة.</li>
                            <li> مساعدة الشركات الصغيرة والمتوسطة على النمو ضمن بيئة تنافسية عادلة.</li>
                        </ul>
                    </div>

                    <p className="mt-14 font-bold text-gray-700">
                    <span className="text-gray-900 font-extrabold text-xl my-2">تجربة مستخدم استثنائية لعملائك</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>تصميم واجهات تسوق سهلة وجذابة تزيد من رضا العملاء وتجعل تجربة الشراء ممتعة وسلسة.</li>
                            <li>تحسينات مستمرة على سرعة وأداء المنصة لضمان تجربة خالية من العوائق.</li>
                            <li>دعم لتعدد اللغات والعملات، مما يمنح عملاءك خيارات مرنة ويعزز التوسع الدولي.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- أدوات تسويق متطورة لزيادة المبيعات</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>إمكانية إنشاء متاجر مخصصة وفقًا لهوية علامتك التجارية لتعكس احترافيتك.</li>
                            <li>تقنيات إعادة استهداف العملاء الذين تركوا عربات التسوق دون إتمام الشراء.</li>
                            <li>إعداد حملات تسويقية تلقائية مخصصة تعتمد على سلوك العملاء، مثل عروض المنتجات المشابهة أو التوصيات الشخصية.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- عروض حصرية للشركاء التجاريين</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>خصومات حصرية على خدمات الشحن والتخزين للتجار المتعاونين معنا.</li>
                            <li>فرص للظهور في حملات إعلانية مدفوعة من “أرابيا”، مما يمنح منتجاتك دفعة تسويقية مجانية.</li>
                            <li>إمكانية الانضمام إلى برامج الشراكة مع العلامات التجارية الكبرى لزيادة انتشار منتجاتك.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- تقنيات ذكاء اصطناعي لتعزيز عملك</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>تحليل شامل لتوجهات السوق وسلوك العملاء باستخدام تقنيات الذكاء الاصطناعي.</li>
                            <li>توصيات لتحسين استراتيجيات التسعير بناءً على المنافسة والطلب.</li>
                            <li>نظام ذكي لتوقع الطلبات المستقبلية وإدارة المخزون بكفاءة.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- خدمات تصوير احترافي للمنتجات</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>فريق متخصص لتصوير منتجاتك بطريقة احترافية وجذابة تبرز مزاياها.</li>
                            <li>تحسين جودة الصور وإعدادها لتناسب المنصة وتجذب العملاء المحتملين.</li>
                            <li>توفير أدوات لتحرير الصور وإضافة تفاصيل مميزة للمنتجات مباشرة من لوحة التحكم.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- دعم متكامل للابتكار والتطوير</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>تحديثات منتظمة تضيف ميزات جديدة لتحسين تجربة التجار والعملاء على حد سواء.</li>
                            <li>استشارات تقنية لتطوير متجرك الإلكتروني بما يناسب احتياجاتك المستقبلية.</li>
                            <li>دعم لإطلاق منتجات جديدة أو عروض حصرية بخطط تسويقية مخصصة.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- إدارة الحملات الموسمية باحترافية</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>تقويم متكامل يعرض جميع الأحداث والمواسم المهمة لتنظيم حملاتك الترويجية مسبقًا.</li>
                            <li>دعم شامل خلال فترات المواسم العالية لضمان جاهزية المخزون والخدمات اللوجستية.</li>
                            <li>مساعدتك في إنشاء عروض موسمية مبتكرة لجذب العملاء وزيادة المبيعات.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- تمكين الشركات الصغيرة والمتوسطة</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>حلول تناسب ميزانيات الشركات الناشئة والصغيرة لتمكينها من المنافسة مع الكبار.</li>
                            <li>برامج تمويلية بالتعاون مع شركاء ماليين لتوسيع نطاق أعمالك.</li>
                            <li>ورش عمل متخصصة لدعمك في التغلب على تحديات السوق وتطوير استراتيجيات فعالة.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- تعزيز التفاعل مع العملاء</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>إمكانية إضافة تقييمات ومراجعات العملاء لمنتجاتك لتعزيز المصداقية.</li>
                            <li>أدوات لاستطلاع رأي العملاء وتقديم استبيانات تساعدك على تحسين خدماتك.</li>
                            <li>خدمة الدردشة الفورية لدعم العملاء، مما يرفع من رضاهم وثقتهم في متجرك.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- منصة مخصصة لكل نوع من التجار</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>دعم كامل للمتاجر الإلكترونية الكبيرة والصغيرة على حد سواء.</li>
                            <li>خدمات متخصصة للتجار في القطاعات المختلفة (الأزياء، الإلكترونيات، المنتجات الغذائية، وغيرها).</li>
                            <li>أدوات خاصة لتجار الجملة والموردين لتسهيل عمليات البيع بكميات كبيرة.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- تقارير تنبؤية لزيادة الكفاءة</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>توقع اتجاهات السوق المستقبلية لتخطيط استراتيجياتك بشكل أفضل.</li>
                            <li>تقارير أداء تفصيلية تساعدك على تحديد المنتجات الأكثر مبيعًا وتحسين المخزون.</li>
                            <li>متابعة فورية لمعدلات إرجاع المنتجات لتحسين جودة الخدمة والمنتجات.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">- بيئة عمل آمنة ومتطورة</span>
                        <ul className="list-disc pl-5 mb-4">
                            <li>حماية متقدمة لبيانات التجار والعملاء باستخدام تقنيات الأمان الحديثة.</li>
                            <li>ضمان الالتزام بالمعايير الدولية لحماية بيانات الدفع والمعاملات.</li>
                            <li>مراقبة مستمرة للحفاظ على جودة وأمان المنصة.</li>
                        </ul>

                        <span className="text-gray-900 font-extrabold text-xl my-2">ما يميز ارابيا كتاجر؟</span>
                        <p>شريك حقيقي يساعدك على تحقيق النجاح في كل خطوة. منصة شاملة تلبي جميع احتياجاتك التجارية، من التسويق إلى الشحن والتحصيل. مرونة في تقديم الحلول التي تناسب حجم أعمالك وأهدافك المستقبلية.</p>
                    </p>
                    <section>
                    <p>
                        للاستفسار حول سياسة الخصوصية أو البيانات الشخصية، يُرجى
                        التواصل معنا عبر البريد الإلكتروني. <a
                                href="mailto:partners@yourarabia.com"
                                className="text-blue-500"
                            >
                                partners@yourarabia.com
                            </a>
                    </p>
                </section>
                    </div>
                </section>
            </section>
        </div>
    );
}
